tsungreports/Lawrence/8-m2.4xlarge-m1medium/criticalpath.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
<clients>
<client host="localhost" use_controller_vm="true" maxusers="50000"/>
</clients>
<servers>
<server host="Atticus-lawrence4-1195071919.us-west-2.elb.amazonaws.com" port="80" type="tcp"/>
</servers>
<load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
</load>
<options>
<option name="glocal_ack_timeout" value="2000"/>
<option type="ts_http" name="user_agent">
<user_agent probability="100">
Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4
</user_agent>
</option>
</options>
<sessions>
<session name="company-path" probability="10" type="ts_http">


        <setdynvars sourcetype="random_number" start="1" end="9999999">
                <var name="random_email_id"/>
        </setdynvars>
        <request subst="true">
                <dyn_variable name="edit_profile_url" re="[Ll]ocation: (http://.*)\r"/>
		<dyn_variable name="user_id" re="[Ll]ocation: http://.*/profiles/(.*)/edit\r"/>
                <http url="/users" version="1.1" method="POST" contents="user%5Bemail%5D=random_email_%%_random_email_id%%%40gmail.com&amp;     user%5Bpassword%5D=12345678&amp;     user%5Bpassword_confirmation%5D=12345678&amp;     user%5Bis_student%5D=false&amp;     commit=Sign+up">
                </http>
        </request>

	<request subst="true">
		<http url="%%_edit_profile_url%%" version="1.1" method="GET">
		</http>
	</request>

    <thinktime random="true" value="2"/>

    <request subst="true">
        <http url="/profiles/%%_user_id%%" version="1.1" method="PUT" contents="user%5Bcorporation%5D=%%_random_email_id%%&amp;                 user%5Bcompany_website%5D=&amp;                 user%5Bprofile%5D=web+programming+firm&amp;                 user%5Bindustry_tag_name%5D=&amp;                 commit=Save">
        </http>
    </request>


        <request subst="true">
                <http url="/profiles" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="1"/>

        <request subst="true">
                <http url="/contracts/new" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="2"/>
        <setdynvars sourcetype="random_number" start="20" end="1000">
                <var name="random_price"/>
        </setdynvars>

        <request subst="true">
                <dyn_variable name="contract_url" re="Location: (http://.*)\r"/>
                <http url="/contracts" version="1.1" method="POST" contents="contract%5Btitle%5D=test+contract+%%_random_email_id%%&amp;     contract%5Bcompany%5D=&amp;     contract%5Bpay%5D=%%_random_price%%&amp;     contract%5Bdeadline%5D=ASAP&amp;     contract%5Bdescription%5D=web+programming+helper+pls&amp;     skill_tag_name=&amp;     commit=Create">
                </http>
        </request>
        <request subst="true">
                <http url="%%_contract_url%%" version="1.1" method="GET">
                </http>
        </request>

        <request subst="true">
		<http url="/profiles/search" version="1.1" method="GET">
                </http>
        </request>

        <request subst="true">
                <http url="/profiles/search?utf8=%E2%9C%93&amp;search=ruby&amp;commit=Search" version="1.1" method="GET">
                </http>
        </request>

        <thinktime random="true" value="2"/>

        <request subst="true">
                <http url="/profiles/1" version="1.1" method="GET">
                </http>
        </request>
</session>
<session name="student-path" probability="90" type="ts_http">

   
    <setdynvars sourcetype="random_number" start="1" end="9999999">
        <var name="random_email_id"/>
    </setdynvars>
   
    <request subst="true">
                <dyn_variable name="edit_profile_url" re="Location: (http://.*)\r"/>
        <dyn_variable name="user_id" re="[Ll]ocation: http://.*/profiles/(.*)/edit\r"/>
                <http url="/users" version="1.1" method="POST" contents="user%5Bemail%5D=student%%_random_email_id%%%40gmail.com&amp;              user%5Bpassword%5D=12345678&amp;user%5Bpassword_confirmation%5D=12345678&amp;user%5Bis_student%5D=true&amp;commit=Sign+up">
                </http>
        </request>

         <request subst="true">
        <http url="/profiles/%%_user_id%%" version="1.1" method="PUT" contents="user%5Bfirst_name%5D=Lawrence%%_random_email_id&amp;user%5Blast_name%5D=Yuan%%_random_email_id&amp;user%5Bschool%5D=UCLA&amp;user%5Blinkedin_url%5D=test&amp;user%5Bgithub_url%5D=test&amp;skill_tag_name=&amp;user%5Bprofile%5D=test_profile_ruby&amp;commit=Save">
        </http>
    </request>
    <request subst="true">
        <http url="/profiles/%%_user_id%%" version="1.1" method="GET">
        </http>
    </request>

    <thinktime random="true" value="1"/>



    <request subst="true">
        <http url="/profiles/search" version="1.1" method="GET">
        </http>
    </request>


    <thinktime random="true" value="5"/>


    <request subst="true">
        <http url="/contracts/search" version="1.1" method="GET">
        </http>
    </request>

    <request subst="true">
        <http url="/contracts/search?utf8=%E2%9C%93&amp;search=web&amp;commit=Search" version="1.1" method="GET">
        </http>
    </request>
   
    <thinktime random="true" value="5"/>


    <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="contract_id"/>
    </setdynvars>

    <request subst="true">
        <http url="/contracts/%%_contract_id%%" version="1.1" method="GET">
        </http>
    </request>

    <thinktime random="true" value="5"/>

    <request subst="true">
        <http url="/contracts/%%_contract_id%%/add" version="1.1" method="GET">
        </http>
    </request>
</session>
</sessions>
</tsung>